edwin-oetelaar/Shared_Energy_Telemetry_Device/sdkconfig.defaults
#  Project configuration. Only the settings this project deliberately chooses
#  live here; everything else comes from the ESP-IDF defaults for whatever
#  version you build with. Regenerate the full sdkconfig by building - it is
#  not checked in, because a generated 4000-line file rewrites itself on every
#  configure and hides the handful of decisions that actually matter.
#
#  Derived from the sdkconfig that was checked in up to commit 08908ec, by
#  diffing it against a pristine default configuration for the ESP32-S3.

#  Hardware: ESP32-S3-BOX-3, 16 MB flash and 16 MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

#  Partition layout: see partitions-box3.csv and docs/PLAN-box3.md. The table
#  sits at 0x11000 rather than the default 0x8000, which is the largest offset
#  the ESP32-S3 allows. That leaves the bootloader its full 64 KB plus a 4 KB
#  signature, so secure boot can still be switched on later (H5). Moving the
#  table is impossible once devices have shipped.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-box3.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x11000

#  Write a core dump to flash on a crash. Without it, a crash in someone's home
#  can only be investigated if a person can reach the device with a cable and
#  the fault repeats.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

#  app_main does TLS work itself: it validates the stored API credentials,
#  which means an HTTPS request with a 4 KB response buffer on this stack. The
#  ESP-IDF default of 3584 bytes overflows immediately.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

#  Note: the old checked-in sdkconfig also carried CONFIG_MBEDTLS_THREADING_C.
#  That is an ESP-IDF 6.1 artefact, not a choice of this project - on 5.5 it
#  selects MBEDTLS_THREADING_ALT without its prerequisites and the build stops
#  with "MBEDTLS_THREADING_ALT defined, but not all prerequisites". Left out on
#  purpose; nothing here needs mbedTLS threading.

#  The status label has to be readable from across the room, so LVGL needs a
#  bigger font than the 14 pixel default it ships with.
CONFIG_LV_FONT_MONTSERRAT_28=y
